# Exercício - Mini Projeto de Análise de Dados

Vamos fazer um exercício completo de pandas para um miniprojeto de análise de dados.

Esse exercício vai obrigar a gente a usar boa parte dos conhecimento de pandas e até de outros módulos que já aprendemos ao longo do curso.

### O que temos?

Temos os dados de 2019 de uma empresa de prestação de serviços. 

- CadastroFuncionarios
- CadastroClientes
- BaseServiçosPrestados

Obs1: Para ler arquivos csv, temos o read_csv<br>
Obs2: Para ler arquivos xlsx (arquivos em excel normais, que não são padrão csv), temos o read_excel

### O que queremos saber/fazer?

1. Valor Total da Folha Salarial -> Qual foi o gasto total com salários de funcionários pela empresa? <br>
    Sugestão: calcule o salário total de cada funcionário, salário + benefícios + impostos, depois some todos os salários
    
    
2. Qual foi o faturamento da empresa?<br>
    Sugestão: calcule o faturamento total de cada serviço e depois some o faturamento de todos
    
    
3. Qual o % de funcionários que já fechou algum contrato?<br>
    Sugestão: na base de serviços temos o funcionário que fechou cada serviço. Mas nem todos os funcionários que a empresa tem já fecharam algum serviço.<br>
    . Na base de funcionários temos uma lista com todos os funcionários<br>
    . Queremos calcular Qtde_Funcionarios_Fecharam_Serviço / Qtde_Funcionários_Totais<br>
    . Para calcular a qtde de funcionários que fecharam algum serviço, use a base de serviços e conte quantos funcionários tem ali. Mas lembre-se, cada funcionário só pode ser contado uma única vez.<br><br>
    Dica: se você aplicar o método .unique() em uma variável que é apenas 1 coluna de um dataframe, ele vai excluir todos os valores duplicados daquela coluna.<br>
    Ex: unicos_colunaA = dataframe['colunaA'].unique() te dá como resposta uma lista com todos os itens da colunaA aparecendo uma única vez. Todos os valores repetidos da colunaA são excluidos da variável unicos_colunaA 
    
    
4. Calcule o total de contratos que cada área da empresa já fechou


5. Calcule o total de funcionários por área


6. Qual o ticket médio mensal (faturamento médio mensal) dos contratos?<br>
    Dica: .mean() calcula a média -> exemplo: media_colunaA = dataframe['colunaA'].mean()

Obs: Lembrando as opções mais usuais de encoding:<br>
encoding='latin1', encoding='ISO-8859-1', encoding='utf-8' ou então encoding='cp1252'

Observação Importante: Se o seu código der um erro na hora de importar os arquivos:<br>
- CadastroClientes.csv
- CadastroFuncionarios.csv

Use separador ";" (ponto e vírgula) para resolver

In [38]:
# Importando o pandas para trabalhar com os arquivos
import pandas as pd

# Importando as tabelas
# Tabela de Servicos Prestados
df_servicos = pd.read_excel('BaseServiçosPrestados.xlsx')
# Importando a tabela de Cadastro de Clientes
df_clientes = pd.read_csv('CadastroClientes.csv', sep=';', decimal=',')
# Importando tabela de cadastro de funcionários
df_funcionarios = pd.read_csv('CadastroFuncionarios.csv', sep=';', decimal=',')

# Eliminando alguns dados das tabelas que não importantes
df_funcionarios = df_funcionarios.drop(['Estado Civil', 'Cargo'], axis=1)

1. Valor Total da Folha Salarial -> Qual foi o gasto total com salários de funcionários pela empresa? <br>
    Sugestão: calcule o salário total de cada funcionário, salário + benefícios + impostos, depois some todos os salários

In [39]:
# Calculando o salário total de cada funcionário 

df_salario_total = df_funcionarios['Salario Base'] + df_funcionarios['Impostos'] + df_funcionarios['Beneficios'] + df_funcionarios['VT'] + df_funcionarios['VR']
df_funcionarios.insert(7, 'Salario Total', df_salario_total)

In [40]:
df_funcionarios.head()

,ID Funcionário,Nome Completo,Salario Base,Impostos,Beneficios,VT,VR,Salario Total,Area
0,1,Gabriel Mesquita,21910,10955.0,4382.0,242,719.04,38208.04,Operações
1,2,João Haddad,5404,2702.0,1080.8,154,574.56,9915.36,Logística
2,3,Amanda Marques Ribeiro,16066,8033.0,3213.2,154,729.12,28195.32,Administrativo
3,4,Guilherme Nunez,21305,10652.5,4261.0,220,524.16,36962.66,Administrativo
4,5,Adelino Gomes,5098,2549.0,1019.6,176,725.76,9568.36,Administrativo

In [43]:
# Calculando o valor total
salario_total = df_funcionarios['Salario Total'].sum()
print('Total da folha salarial mensal é de: R${:,}'.format(salario_total))

Total da folha salarial mensal é de: R$2,717,493.22

2. Qual foi o faturamento da empresa?<br>
    Sugestão: calcule o faturamento total de cada serviço e depois some o faturamento de todos

In [44]:
df_servicos.head()

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses)
0,OS0001,67,1,14
1,OS0002,17,2,12
2,OS0003,116,4,14
3,OS0004,37,5,8
4,OS0005,130,6,8

In [53]:
df_clientes.head()

   ID Cliente             Cliente  Valor Contrato Mensal
0           1  Teixeira Gonçalves                    540
1           2        Souza Santos                   1260
2           3        Emídio Alves                   3195
3           4        Santos Costa                   2520
4           5         Do Monteiro                   3510

In [65]:
df_faturamento = df_servicos[['ID Cliente', 'Tempo Total de Contrato (Meses)']].merge(df_clientes[['ID Cliente', 'Valor Contrato Mensal']])
df_faturamento.head()

   ID Cliente  Tempo Total de Contrato (Meses)  Valor Contrato Mensal
0           1                               14                    540
1           2                               12                   1260
2           4                               14                   2520
3           5                                8                   3510
4           6                                8                   2340

In [66]:
# Calculando o valor do faturamento

df_faturamento['Total Faturamento'] = (df_faturamento['Tempo Total de Contrato (Meses)'] * df_faturamento['Valor Contrato Mensal'])
print('O valor total do faturamento da empresa é de: R${:,}'.format(df_faturamento['Total Faturamento'].sum()))

O valor total do faturamento da empresa é de: R$5,519,160

3. Qual o % de funcionários que já fechou algum contrato?<br>
    Sugestão: na base de serviços temos o funcionário que fechou cada serviço. Mas nem todos os funcionários que a empresa tem já fecharam algum serviço.<br>
    . Na base de funcionários temos uma lista com todos os funcionários<br>
    . Queremos calcular Qtde_Funcionarios_Fecharam_Serviço / Qtde_Funcionários_Totais<br>
    . Para calcular a qtde de funcionários que fecharam algum serviço, use a base de serviços e conte quantos funcionários tem ali. Mas lembre-se, cada funcionário só pode ser contado uma única vez.<br><br>
    Dica: se você aplicar o método .unique() em uma variável que é apenas 1 coluna de um dataframe, ele vai excluir todos os valores duplicados daquela coluna.<br>
    Ex: unicos_colunaA = dataframe['colunaA'].unique() te dá como resposta uma lista com todos os itens da colunaA aparecendo uma única vez. Todos os valores repetidos da colunaA são excluidos da variável unicos_colunaA

In [78]:
funcionarios_com_servicos = len(df_servicos['ID Funcionário'].unique())
total_funcionarios = len(df_funcionarios['ID Funcionário'])
porcentagem_funcionario = funcionarios_com_servicos / total_funcionarios
print('A porcentagem de funcionários que já fecharam um serviço é de: {:.2%}'.format(porcentagem_funcionario))

A porcentagem de funcionários que já fecharam um serviço é de: 86.84%

4. Calcule o total de contratos que cada área da empresa já fechou

In [83]:
df_funcionarios.head()

,ID Funcionário,Nome Completo,Salario Base,Impostos,Beneficios,VT,VR,Salario Total,Area
0,1,Gabriel Mesquita,21910,10955.0,4382.0,242,719.04,38208.04,Operações
1,2,João Haddad,5404,2702.0,1080.8,154,574.56,9915.36,Logística
2,3,Amanda Marques Ribeiro,16066,8033.0,3213.2,154,729.12,28195.32,Administrativo
3,4,Guilherme Nunez,21305,10652.5,4261.0,220,524.16,36962.66,Administrativo
4,5,Adelino Gomes,5098,2549.0,1019.6,176,725.76,9568.36,Administrativo

In [90]:
df_contratos_area = df_servicos[['ID Funcionário']].merge(df_funcionarios[['ID Funcionário', 'Area']], on='ID Funcionário')
contratos_area_quantidade = df_contratos_area['Area'].value_counts()
print(contratos_area_quantidade)

Administrativo    63
Operações         48
Comercial         44
Financeiro        42
Logística         40
Name: Area, dtype: int64

5. Calcule o total de funcionários por área

In [91]:
total_funcionarios_area = df_funcionarios.value_counts('Area')
print(total_funcionarios_area)

Area
Administrativo    26
Comercial         26
Operações         23
Logística         21
Financeiro        18
dtype: int64

6. Qual o ticket médio mensal (faturamento médio mensal) dos contratos?<br>
    Dica: .mean() calcula a média -> exemplo: media_colunaA = dataframe['colunaA'].mean()

In [94]:
ticket_medio = df_clientes['Valor Contrato Mensal'].mean()
print('O valor do ticket médio mensal é de : {:,.2f}'.format(ticket_medio))

O valor do ticket médio mensal é de : 2,502.56